Repository: FPGAwars/iceGates
Catalog: locale/*/*.po
Languages: es_es

source: The output is 1 if the current value is 1 and the previous 0, or if the current value is 0 and the previous 1
es_es: La salida es 1 si el valor actua es 1 y el previo 0, o si el valor actual es 0 y el previo 1

source: In any other case the output is 0
es_es: En cualquier otro caso la salida es 0

source: When k=0, it works like a wire (The output is equal to the input) When k=1, it act as a not gate (The output is the inverse of the input)
es_es: Cuando k=0, funciona como un cable (La salida es igual a la entrada) Cuando k=1, actúa como una puerta NOT (La salida es la inversa de la entrada)

source: ### Truth table for XOR | k | input | output | function | |---|-------|--------|----------| | 0 | 0 | 0 | wire | | 0 | 1 | 1 | wire | | 1 | 0 | 1 | Not | | 1 | 1 | 0 | Not |
es_es: ### Tabla de verdad para XOR | k | Entrada | Salida | Función | |---|-------|--------|----------| | 0 | 0 | 0 | cable | | 0 | 1 | 1 | cable | | 1 | 0 | 1 | Not | | 1 | 1 | 0 | Not |

source: Channel B
es_es: Canal B

source: Channel A
es_es: Canal A

source: Byte 0 (least significant)
es_es: Byte 0 (Menos significativo)

source: D Flip-flip (System)
es_es: Biestable D (Sistema)

source: # AND-Op2: Manual testing with two pushbuttons and two LEDs The AND operation is applied to the bits coming form the pushbuttons and a constant number. The result is shown on the LEDs
es_es: # AND-Op2: Comprobación manual con pulsadores y LEDs La operación AND se aplica entre los 3 bits que llegan de los pulsadores y un número constante. El resultado se muestra en los LEDs

source: Bus3-Join-1-2: Join two buses of 2 and 1 bits into a 3-bits Bus
es_es: Bus3-Join-1-2: Agrupar dos buses de 2 y 1 bits en un bus de 3 bits

source: # AND-Op3: Manual testing with two pushbuttons and two LEDs The AND operation is applied to the 3-bits coming form the pushbuttons and a constant number. The result is shown on the LEDs
es_es: # AND-Op3: Comprobación manual con pulsadores y LEDs La operación AND se aplica entre los 3 bits que llegan de los pulsadores y un número constante. El resultado se muestra en los LEDs

source: # AND-Op4: Manual testing with two pushbuttons and two LEDs The AND operation is applied to the 4-bits coming form the pushbuttons and a constant number. The result is shown on the LEDs
es_es: # AND-Op4: Comprobación manual con pulsadores y LEDs La operación AND se aplica entre los 4 bits que llegan de los pulsadores y un número constante. El resultado se muestra en los LEDs

source: # AND-Op5: Manual testing with two pushbuttons and two LEDs The AND operation is applied to the 5-bits coming form the pushbuttons and a constant number. The result is shown on the LEDs
es_es: # AND-Op5: Comprobación manual con pulsadores y LEDs La operación AND se aplica entre los 5 bits que llegan de los pulsadores y un número constante. El resultado se muestra en los LEDs

source: # AND-Op6: Manual testing with two pushbuttons and two LEDs The AND operation is applied to the 6-bits coming form the pushbuttons and a constant number. The result is shown on the LEDs
es_es: # AND-Op6: Comprobación manual con pulsadores y LEDs La operación AND se aplica entre los 6 bits que llegan de los pulsadores y un número constante. El resultado se muestra en los LEDs

source: Bus7-Join-5-2: Join the two buses into a 7-bits Bus
es_es: Bus7-Join-5-2: Agrupar los dos buses en uno de 7 bits

source: # AND-Op7: Manual testing with two pushbuttons and two LEDs The AND operation is applied to the 7-bits coming form the pushbuttons and a constant number. The result is shown on the LEDs
es_es: # AND-Op3: Comprobación manual con pulsadores y LEDs La operación AND se aplica entre los 7 bits que llegan de los pulsadores y un número constante. El resultado se muestra en los LEDs

source: Bus8-Join-6-2: Join the two buses into an 8-bits Bus
es_es: Bus8-Join-6-2: Agrupar todos los cables en un bus de 8 bits

source: # AND-Op8: Manual testing with two pushbuttons and two LEDs The AND operation is applied to the 8-bits coming form the pushbuttons and a constant number. The result is shown on the LEDs
es_es: # AND-Op3: Comprobación manual con pulsadores y LEDs La operación AND se aplica entre los 8 bits que llegan de los pulsadores y un número constante. El resultado se muestra en los LEDs

source: # AND gate: Manual testing with two pushbuttons and one LED The LED is only turned on when both buttons are pressed at the same time
es_es: # Puerta AND: Comprobación manual con dos pulsadores y un LED El LED sólo se enciende cuando ambos botones están presionados a la vez

source: ## And Truth table | i1 | i0 | output | |-----|-----|--------| | 0 | 0 | 0 | | 0 | 1 | 0 | | 1 | 0 | 0 | | 1 | 1 | 1 |
es_es: ## Tabla de verdad de la AND | i1 | i0 | output | |-----|-----|--------| | 0 | 0 | 0 | | 0 | 1 | 0 | | 1 | 0 | 0 | | 1 | 1 | 1 |

source: # AND gate: Manual testing with three pushbuttons and one LED The LED is only turned on when both buttons are pressed at the same time
es_es: # Puerta AND: Comprobación manual con tres pulsadores y un LED El LED sólo se enciende cuando todos los están presionados a la vez

source: # AND5 gate: Manual testing with pushbuttons and one LED The LED is only turned on when both buttons are pressed at the same time
es_es: # Puerta AND5: Comprobación manual con pulsadores y un LED El LED sólo se enciende cuando ambos botones están presionados a la vez

source: # AND6 gate: Manual testing with pushbuttons and one LED The LED is only turned on when both buttons are pressed at the same time
es_es: # Puerta AND6: Comprobación manual con pulsadores y un LED El LED sólo se enciende cuando ambos botones están presionados a la vez

source: # AND7 gate: Manual testing with pushbuttons and one LED The LED is only turned on when both buttons are pressed at the same time
es_es: # Puerta AND7: Comprobación manual con pulsadores y un LED El LED sólo se enciende cuando ambos botones están presionados a la vez

source: # AND8 gate: Manual testing with pushbuttons and one LED The LED is only turned on when both buttons are pressed at the same time
es_es: # Puerta AND8: Comprobación manual con pulsadores y un LED El LED sólo se enciende cuando ambos botones están presionados a la vez

source: # NAND gate: Manual testing with two pushbuttons and one LED Only when the two buttons are pressed at the same time, the LED0 is turned off
es_es: # Puerta NAND: Comprobación manual con dos pulsadores y un LED El LED sólo se enciende cuando ambos botones están presionados a la vez

source: ## NAND Truth table | i1 | i0 | output | |-----|-----|--------| | 0 | 0 | 1 | | 0 | 1 | 1 | | 1 | 0 | 1 | | 1 | 1 | 0 |
es_es: ## Tabla de verdad de la NAND | i1 | i0 | output | |-----|-----|--------| | 0 | 0 | 1 | | 0 | 1 | 1 | | 1 | 0 | 1 | | 1 | 1 | 0 |

source: # NOR gate: Manual testing with two pushbuttons and one LED The LED is only on when none of the butons is pressed
es_es: # Puerta NOR: Comprobación manual con dos pulsadores y un LED El LED sólo se enciende cuando ninguno de los botones está apretado

source: ## NOR Truth table | i1 | i0 | output | |-----|-----|--------| | 0 | 0 | 1 | | 0 | 1 | 0 | | 1 | 0 | 0 | | 1 | 1 | 0 |
es_es: ## Tabla de verdad de la NOR | i1 | i0 | output | |-----|-----|--------| | 0 | 0 | 1 | | 0 | 1 | 0 | | 1 | 0 | 0 | | 1 | 1 | 0 |

source: # Not gate: Manual testing with a pushbutton and an LED When the button SW1 is not pressed, the input is 0. The output of the not is 1 and the LED is on When the button SW1 is pressed, the input is 1, the output 0 and the LED is off
es_es: # Puerta Not: Prueba manual con un pulsador y un LED Cuando el pulsador SW1 NO está pulsado, la entrada es 0. La salida de la not es 1 y el LED está encendido Cuando se aprieta el botón SW1, la entrada es 1, la salida 0 y el LED se apaga

source: # Not-x2 gate: Manual testing with pushbuttons and LEDs The two buttons are inverted (negaive logic) and displayed on the LEDs
es_es: # Puerta Not-x2: Comprobación manual con pulsadores y LEDs Los dos pulsadores se invierten (logica negativa) y se muestran en los LEDs

source: # Not-x3 gate: Manual testing with pushbuttons and LEDs The three inputs are inverted (negaive logic) and displayed on the LEDs
es_es: # Puerta Not-x3: Comprobación manual con pulsadores y LEDs Las tres entradas se invierten (logica negativa) y se muestran en los LEDs

source: 2bits constant value: 0
es_es: Valor constante 0 de 2 bits

source: # Not-x4 gate: Manual testing with pushbuttons and LEDs The four inputs are inverted (negaive logic) and displayed on the LEDs
es_es: # Puerta Not-x4: Comprobación manual con un pulsador y LEDs Las 4 entradas se invierten (Lógica negativa) y se muestran en los LEDs

source: 3bits constant value: 0
es_es: Valor constante 0 de 3 bits

source: # Not-x5 gate: Manual testing with pushbuttons and LEDs The 5 inputs are inverted (negative logic) and displayed on the LEDs
es_es: # Puerta Not-x5: Comprobación manual con un pulsador y LEDs Las 5 entradas se invierten (Lógica negativa) y se muestran en los LEDs

source: 4bits constant value: 0
es_es: Valor constante 0 de 4 bits

source: # Not-x6 gate: Manual testing with pushbuttons and LEDs The 6 inputs are inverted (negative logic) and displayed on the LEDs
es_es: # Puerta Not-x6: Comprobación manual con un pulsador y LEDs Las 6 entradas se invierten (Lógica negativa) y se muestran en los LEDs

source: 5bits constant value: 0
es_es: Valor constante 0 de 5 bits

source: # Not-x7 gate: Manual testing with pushbuttons and LEDs The 6 inputs are inverted (negative logic) and displayed on the LEDs
es_es: # Puerta Not-x7: Comprobación manual con un pulsador y LEDs Las 7 entradas se invierten (Lógica negativa) y se muestran en los LEDs

source: 6bits constant value: 0
es_es: Valor constante 0 de 6 bits

source: # Not-x8 gate: Manual testing with pushbuttons and LEDs The four inputs are inverted (negaive logic) and displayed on the LEDs
es_es: Puerta Not-x8: Comprobación manual con pulsadores y LEDs Las 8 entradas se invierten (Lógica negativa) y se muestran en los LEDs

source: Bus16-Join-1-15: Join the two buses into a 16-bits Bus
es_es: Bus16-join-1-15: Unir dos buses en un bus de 16 bits

source: 15bits constant value: 0
es_es: Valor constante de 15 bits: 0

source: Generic: 15-bits generic constant
es_es: Generic: Constante genérica de 15-bits

source: # Not-x16 gate: Manual testing with pushbuttons and LEDs All the inputs are inverted (negaive logic) and displayed on the LEDs
es_es: # Puerta Not-x16: Comprobación manual con un pulsador y LEDs Todas las entradas se invierten (Lógica negativa) y se muestran en los LEDs

source: # OR-Bus2 gate: Manual testing with two pushbutton and an LED The LED is turned on when the button SW1 is pressed, or the button SW1 or both
es_es: # Puerta OR-Bus2: Comprobación manual con dos pulsadores y un LED El LED se enciende cuando el botón SW1 , el SW2 o ambos se aprietan

source: # OR-Bus3 gate: Manual testing with two pushbutton and an LED The LED is turned on when the button SW1 is pressed, or the button SW1 or both
es_es: # Puerta OR-Bus3: Comprobación manual con dos pulsadores y un LED El LED se enciende cuando el botón SW1 , el SW2 o ambos se aprietan

source: # OR-Bus4 gate: Manual testing with two pushbutton and an LED The LED is turned on when the button SW1 is pressed, or the button SW1 or both
es_es: # Puerta OR-Bus4: Comprobación manual con dos pulsadores y un LED El LED se enciende cuando el botón SW1 , el SW2 o ambos se aprietan

source: # OR-Bus5 gate: Manual testing with two pushbutton and an LED The LED is turned on when the button SW1 is pressed, or the button SW1 or both
es_es: # Puerta OR-Bus5: Comprobación manual con dos pulsadores y un LED El LED se enciende cuando el botón SW1 , el SW2 o ambos se aprietan

source: Bus6-Join-all: Join all the wires into a 6-bits Bus
es_es: Bus6-Join-all: Agrupar todos los cables en un bus de 6 bits

source: # OR-Bus6 gate: Manual testing with two pushbutton and an LED The LED is turned on when the button SW1 is pressed, or the button SW1 or both
es_es: # Puerta OR-Bus6: Comprobación manual con dos pulsadores y un LED El LED se enciende cuando el botón SW1 , el SW2 o ambos se aprietan

source: Bus7-Join-all: Join all the wires into a 7-bits Bus
es_es: Bus7-Join-all: Agrupar todos los cables en un bus de 7-bits

source: # OR-Bus7 gate: Manual testing with two pushbutton and an LED The LED is turned on when the button SW1 is pressed, or the button SW1 or both
es_es: # Puerta OR-Bus7: Comprobación manual con dos pulsadores y un LED El LED se enciende cuando el botón SW1 , el SW2 o ambos se aprietan

source: Bus8-Join-all: Join all the wires into a 8-bits Bus
es_es: Bus8-Join-all: Agrupar todos los cables en un bus de 8 bits

source: # OR-Bus8 gate: Manual testing with two pushbutton and an LED The LED is turned on when the button SW1 is pressed, or the button SW1 or both
es_es: # Puerta OR-Bus8: Comprobación manual con dos pulsadores y un LED El LED se enciende cuando el botón SW1 , el SW2 o ambos se aprietan

source: # OR-Op16: Manual testing with two pushbuttons and two LEDs The OR operation is applied to the 8-bits coming form the pushbuttons and a constant number. The result is shown on the LEDs
es_es: # OR-Op16: Comprobación manual con dos pulsadores y dos LEDs La operación OR se aplica entre los 8 bits que llegan de los pulsadores y un número constante. El resultado se muestra en los LEDs

source: # OR-Op2: Manual testing with two pushbuttons and two LEDs The OR operation is applied to the 2-bits coming form the pushbuttons and a constant number (0-3). The result is shown on LEDs 0 and 1 The number 0 is used by default
es_es: # OR-OP2: Comprobación manual con dos pulsadores y dos LEDs La operación OR se aplica entre los dos bits que llegan de los pulsadores y un número constante (0-3). El resultado se muestra en los LEDs 0 y 1 El número 0 se usa por defecto

source: # OR-Op3: Manual testing with two pushbuttons and two LEDs The OR operation is applied to the 3-bits coming form the pushbuttons and a constant number. The result is shown on the LEDs
es_es: # OR-Op3: Comprobación manual con dos pulsadores y dos LEDs La operación OR se aplica entre los 3 bits que llegan de los pulsadores y un número constante. El resultado se muestra en los LEDs

source: # OR-Op4: Manual testing with two pushbuttons and two LEDs The OR operation is applied to the 4-bits coming form the pushbuttons and a constant number. The result is shown on the LEDs
es_es: # OR-Op4: Comprobación manual con dos pulsadores y dos LEDs La operación OR se aplica entre los 4 bits que llegan de los pulsadores y un número constante. El resultado se muestra en los LEDs

source: # OR-Op5: Manual testing with two pushbuttons and two LEDs The OR operation is applied to the 5-bits coming form the pushbuttons and a constant number. The result is shown on the LEDs
es_es: # OR-Op5: Comprobación manual con dos pulsadores y dos LEDs La operación OR se aplica entre los 5 bits que llegan de los pulsadores y un número constante. El resultado se muestra en los LEDs

source: # OR-Op6: Manual testing with two pushbuttons and LEDs The OR operation is applied to the 6-bits coming form the pushbuttons and a constant number. The result is shown on the LEDs
es_es: # OR-Op6: Comprobación manual con dos pulsadores y dos LEDs La operación OR se aplica entre los 6 bits que llegan de los pulsadores y un número constante. El resultado se muestra en los LEDs

source: # OR-Op8: Manual testing with two pushbuttons and two LEDs The OR operation is applied to the 8-bits coming form the pushbuttons and a constant number. The result is shown on the LEDs
es_es: # OR-Op8: Comprobación manual con dos pulsadores y dos LEDs La operación OR se aplica entre los 8 bits que llegan de los pulsadores y un número constante. El resultado se muestra en los LEDs

source: # OR-Op7: Manual testing with two pushbuttons and LEDs The OR operation is applied to the 7-bits coming form the pushbuttons and a constant number. The result is shown on the LEDs
es_es: # OR-Op7: Comprobación manual con dos pulsadores y dos LEDs La operación OR se aplica entre los 7 bits que llegan de los pulsadores y un número constante. El resultado se muestra en los LEDs

source: # OR gate: Manual testing with two pushbuttons and one LED The LED is turned on if button 1 or button 2 or both are pressed. Otherwise the LED0 is off
es_es: # Puerta OR: Comprobación manual con dos pulsadores y un LED El LED se enciende si el botón 1, o el boton 2 o ambos están apretado. En otro caso el LED0 está apagado

source: ## OR Truth table | i1 | i0 | output | |-----|-----|--------| | 0 | 0 | 0 | | 0 | 1 | 1 | | 1 | 0 | 1 | | 1 | 1 | 1 |
es_es: ## Tabla de verdad de la OR | i1 | i0 | output | |-----|-----|--------| | 0 | 0 | 0 | | 0 | 1 | 1 | | 1 | 0 | 1 | | 1 | 1 | 1 |

source: # OR4 gate: Manual testing with two pushbuttons and one LED The LED is turned on if button 1 or button 2 or both are pressed. Otherwise the LED0 is off
es_es: # Puerta OR4: Comprobación manual con dos pulsadores y un LED El LED se enciende si el botón 1, o el boton 2 o ambos están apretado. En otro caso el LED0 está apagado

source: # OR5 gate: Manual testing with two pushbuttons and one LED The LED is turned on if button 1 or button 2 or both are pressed. Otherwise the LED0 is off
es_es: # Puerta OR5: Comprobación manual con dos pulsadores y un LED El LED se enciende si el botón 1, o el boton 2 o ambos están apretado. En otro caso el LED0 está apagado

source: # OR6 gate: Manual testing with two pushbuttons and one LED The LED is turned on if button 1 or button 2 or both are pressed. Otherwise the LED0 is off
es_es: # Puerta OR6: Comprobación manual con dos pulsadores y un LED El LED se enciende si el botón 1, o el boton 2 o ambos están apretado. En otro caso el LED0 está apagado

source: # OR7 gate: Manual testing with two pushbuttons and one LED The LED is turned on if button 1 or button 2 or both are pressed. Otherwise the LED0 is off
es_es: # Puerta OR7: Comprobación manual con dos pulsadores y un LED El LED se enciende si el botón 1, o el boton 2 o ambos están apretado. En otro caso el LED0 está apagado

source: # OR8 gate: Manual testing with two pushbuttons and one LED The LED is turned on if button 1 or button 2 or both are pressed. Otherwise the LED0 is off
es_es: # Puerta OR8: Comprobación manual con dos pulsadores y un LED El LED se enciende si el botón 1, o el boton 2 o ambos están apretado. En otro caso el LED0 está apagado

source: # XNOR-Op2: Manual testing with two pushbuttons and two LEDs The XNOR operation is applied to the 2-bits coming form the pushbuttons and a constant number (0-3). The result is shown on LEDs 0 and 1
es_es: # XNOR-OP2: Comprobación manual con dos pulsadores y dos LEDs La operación XNOR se aplica entre los dos bits que llegan de los pulsadores y un número constante (0-3). El resultado se muestra en los LEDs 0 y 1

source: # XNOR-Op3: Manual testing with two pushbuttons and two LEDs The XNOR operation is applied to the 3-bits coming form the pushbuttons and a constant number. The result is shown on the LEDs
es_es: # XNOR-Op3: Comprobación manual con dos pulsadores y dos LEDs La operación XNOR se aplica entre los 3 bits que llegan de los pulsadores y un número constante. El resultado se muestra en los LEDs

source: # XNOR-Op4: Manual testing with two pushbuttons and two LEDs The XNOR operation is applied to the 4-bits coming form the pushbuttons and a constant number. The result is shown on the LEDs
es_es: # XNOR-Op4: Comprobación manual con dos pulsadores y dos LEDs La operación XNOR se aplica entre los 4 bits que llegan de los pulsadores y un número constante. El resultado se muestra en los LEDs

source: # XNOR gate: Manual testing with two pushbuttons and one LED
es_es: # Puerta XNOR: Comprobación manual con dos pulsadores y un LED

source: ## XNOR Truth table | i1 | i0 | output | |-----|-----|--------| | 0 | 0 | 1 | | 0 | 1 | 0 | | 1 | 0 | 0 | | 1 | 1 | 1 |
es_es: ## Tabla de verdad de la XNOR | i1 | i0 | output | |-----|-----|--------| | 0 | 0 | 1 | | 0 | 1 | 0 | | 1 | 0 | 0 | | 1 | 1 | 1 |

source: # XOR-Op2: Manual testing with two pushbuttons and two LEDs The XOR operation is applied to the 2-bits coming form the pushbuttons and a constant number (0-3). The result is shown on LEDs 0 and 1
es_es: # XOR-OP2: Comprobación manual con dos pulsadores y dos LEDs La operación XOR se aplica entre los dos bits que llegan de los pulsadores y un número constante (0-3). El resultado se muestra en los LEDs 0 y 1

source: # XOR-Op3: Manual testing with two pushbuttons and two LEDs The XOR operation is applied to the 3-bits coming form the pushbuttons and a constant number. The result is shown on the LEDs
es_es: # XOR-Op3: Comprobación manual con dos pulsadores y dos LEDs La operación XOR se aplica entre los 3 bits que llegan de los pulsadores y un número constante. El resultado se muestra en los LEDs

source: # XOR-Op4: Manual testing with two pushbuttons and two LEDs The XOR operation is applied to the 4-bits coming form the pushbuttons and a constant number. The result is shown on the LEDs
es_es: # XOR-Op4: Comprobación manual con dos pulsadores y dos LEDs La operación XOR se aplica entre los 4 bits que llegan de los pulsadores y un número constante. El resultado se muestra en los LEDs

source: # XOR gate: Manual testing with two pushbuttons and one LED The LED is turned on only if button 1 is pressed or button 2 is pressed but not both at the same time
es_es: # Puerta XOR: Comprobación manual con dos pulsadores y un LED El LED se enciende sólo si el botón 1 está apretado, o el dos está apretado pero no ambos a la vez

source: ## XOR Truth table | i1 | i0 | output | |-----|-----|--------| | 0 | 0 | 0 | | 0 | 1 | 1 | | 1 | 0 | 1 | | 1 | 1 | 0 |
es_es: ## Tabla de verdad de la XOR | i1 | i0 | output | |-----|-----|--------| | 0 | 0 | 0 | | 0 | 1 | 1 | | 1 | 0 | 1 | | 1 | 1 | 0 |
