Repository: FPGAwars/iceGates
Catalog: locale/*/*.po
Languages: es_es

source: Red and blue disabled
es_es: Rojo y azul apagados

source: Negative logic
es_es: Lógica negativa

source: Green component
es_es: Componente verde

source: Switches are in negative logic
es_es: Los interruptores van con lógica negativa

source: Positive logic here
es_es: Lógica positiva aquí

source: **AND-BUS2 Gate**
es_es: **Puerta AND-BUS2**

source: ## Example: Manual testing of the AND-BUS2 gate The LED is only ON when the two buttons SW1 and SW2 are pressed
es_es: # Ejemplo: Comprobación manual de la puerta AND-BUS2 El LED sólo se enciende cuando los dos botones SW1 y SW2 están apretados

source: ## Example: Manual testing of the AND-BUS2 gate The RGB LED is turned GREEN only when the two buttons SW1 and SW2 are ON
es_es: # Ejemplo: Comprobación manual de la puerta AND-BUS2 El LED RGB se poner VERDE sólo cuando los dos botones sw1 y sw2 están activados

source: 4bits constant value: 15 (0xF in hexadecimal)
es_es: Valor constante de 4 bits: 15 (0xF en hexadecimal)

source: Generic: 4-bits generic constant (0-15)
es_es: Generic: Constante genérica de 4 bits (0-15)

source: **AND-Busen4**
es_es: **Puerta AND-Busen4**

source: ## Example: Manual testing of the AND-Busen4 gate The given number by the 4-bits constant (0xF by default) is displayed on the LEDs when the button is pressed
es_es: # Ejemplo: Comprobación manual de la puerta AND-Busen4 El número dado por los 4-bits constantes (0xF por defecto) se muestra en los LEDs cuando se aprieta el botón

source: Enable button
es_es: Habilitar botón

source: Generic: 3-bits generic constant (0-7)
es_es: Generic: Constantes genéricas de 3 bits (0-7)

source: ## Example: Manual testing of the AND-Busen4 gate The given number by the 3-bits constant is used to activate the RGB LED Changing this value will change the color displayed on the LED It only works if the switch s1 is ON
es_es: # Ejemplo: Comprobación manual de la puerta AND-Busen4 El número dado por los 3-bits constantes se usa para activar el LED RGB Cambiando este calor se modificará el color mostrado en el LED Sólo funciona si el switch s1 está activado

source: Enable button (Negative logic)
es_es: Botón de habilitación (Lógica negativa)

source: ## RGB LED Negative logic
es_es: ## LED RGB Lógica negativa

source: ## Example: Manual testing of the AND-Op4 gate The AND-Op4 gate perform the AND operation between operand a and b. When the button is pressed the operand b has a value (`0011` by default) otherwise operand b is 0
es_es: # Ejemplo: Comprobación manual de la puerta AND-Op4 La puerta AND-Op4 realiza la operación AND entre los operandos a y b. Cuando el botón se aprieta el operando b tiene un valor (`0011` por defecto) de lo contrario el operando b es 0

source: Operand b or 0
es_es: Operando b ó 0

source: Enable the operand b
es_es: Habilitar el operando b

source: ## Example: Manual testing of the AND-Op3 gate The AND-Op3 gate perform the AND operation between operands a and b. When the switch is ON the operand b has a value (`111` by default) otherwise operand b is 0 The result of the AND operation is shown on the RGB LED
es_es: # Ejemplo: Comprobación manual de la puerta AND-Op3 La puerta AND-Op3 realiza la operación AND entre los operandos a y b. Cuando el interruptor está activado el operando b tiene un valor (`111` por defecto) de lo contrario el operando b es 0 El resultado de la operación AND se muestra en el LED RGB

source: **OR Gate**
es_es: **Puerta OR**

source: ## Example: Manual testing of the OR2 gate The LED is turned on when any button (or both) are pressed
es_es: # Ejemplo: Comprobación manual de la puerta OR2 El LED se enciende cuando algún botón (o ambos) se aprietan

source: ## Example: Manual testing of the OR2 gate The RGB LED is turned GREEN if either switches s1 or s2 (or both) are ON
es_es: # Ejemplo: Comprobación manual de la puerta OR2 El LED RGB se pone VERDE si bien el interruptor s1 o el s2 (o ambos) están activados

source: **OR-BUS2 Gate**
es_es: **Puerta OR-BUS2**

source: ## Example: Manual testing of the OR-BUS2 gate The LED is ON when any of the buttons (or both) are pressed
es_es: # Ejemplo: Comprobación manual de la puerta OR-BUS2 El LED se enciende cuando alguno de los botones (or ambos) se aprietan

source: ## Example: Manual testing of the OR-BUS2 gate The RGB LED is turned GREEN when any of the switches (or both) are ON
es_es: # Ejemplo: Comprobación manual de la puerta OR-BUS2 El LED RGB se pone a VERDE cuando alguno de los interruptores (o ambos) están activados

source: ## Example: Manual testing of the OR-Op4 gate The OR-Op4 gate perform the OR operation between operand a and b. When the button is pressed the operand b has a value (`0011` by default) otherwise operand b is 0
es_es: # Ejemplo: Comprobación manual de la puerta OR-Op4 La puerta OR-Op4 realiza la operación OR entre los operandos a y b. Cuando el botón se aprieta, el operando b tiene un valor (`0011`por defecto) En cualquier otro caso el operando b es 0

source: ## Example: Manual testing of the OR-Op3 gate The OR-Op3 gate perform the OR operation between operands a and b. When the switch is ON the operand b has a value (`001` by default) otherwise operand b is 0 The result of the OR operation is shown on the RGB LED
es_es: # Ejemplo: Comprobación manual de la puerta OR-Op3 La puerta OR-Op3 realiza la operación OR entre los operandos a y b. Cuando el interruptor se activa el operando b tiene un valor (`001` por defecto) de lo contrario el operando b es 0 El resultado de la operación OR se muestra en el LED RGB

source: **NOT gate**
es_es: **Puerta NOT**

source: ## Example: Manual testing of the NOT gate The NOT gate performs the NOT operation on the input comming from the button. The output is shown on the LEDs
es_es: # Ejemplo: Comprobación manual de la puerta NOT La puerta NOT realiza la operación NOT en la entrada que viene del botón. La salida se muestra en los LEDs

source: ## INPUT
es_es: ## ENTRADA

source: ## Example: Manual testing of the NOT gate The NOT gate performs the NOT operation on the input comming from the switch. The output turn GREEN the RGB LED
es_es: # Ejemplo: Comprobación manual de la puerta NOT La puerta NOT realiza la operación NOT en la entrada que viene del botón. La salida enciende el LED RGBs

source: ## Example: Manual testing of the NOT-4 gate A 4-bit number is entered as the input of the NOT-4 gate and its output is shown on the LED. If the buton is not pressed, the number is 0, so that all the LEDs are ON. When the button is pressed the number used in the NOT operation is `0101`. The result is the number `1010` that can be seen on the LED
es_es: # Ejemplo: Comprobación manual de la puerta NOT-4 Se introduce un número de 4-bits por la entrada de la puerta NOT-4 y su salida se muestra en el LED. Si el botón no está apretado, el número es 0, por lo que los LEDs están encendidos. Cuando el botón se aprieta, el número usado en la operación NOT es `0101`. El resultado es el número `1010` que se puede ver en el LED

source: Operand a
es_es: Operando a

source: ## Example: Manual testing of the NOT-3 gate The 3-bit number introduced in the Swtiches is inverted using the NOT-3 gate. The result is displayed on the RBG LED
es_es: # Ejemplo: Comprobación manual de la puerta NOT de 3 bits El número de 3-bits introducido por los swithes se invierte unsando la puerta NOT-3. El resultado se muestra en el LED RGB

source: ## RGB LED
es_es: ## LED RGB

source: ## Example: Manual testing of the XOR gate
es_es: # Ejemplo: Comprobación manual de la puerta XOR

source: ## Example: Manual testing of the XOR-Op4 gate The XOR-Op4 gate perform the XOR operation between operand a and b. When the button is pressed the operand b has a value (`0011` by default) otherwise operand b is 0
es_es: # Ejemplo: Comprobación manual de la puerta XOR-Op4 La puerta XOR-Op4 realiza la operación XOR entre los operandos a y b. Cuando el botón se aprieta, el operando b tiene el valor (`0011` por defecto) En cualquier otro caso el operando b es 0

source: ## Example: Manual testing of the XOR-Op3 gate The XOR-Op3 gate performs the XOR operation between operands a and b. When the switch is ON the operand b has a value (`111` by default) otherwise operand b is 0 The result of the XOR operation is shown on the RGB LED
es_es: # Ejemplo: Comprobación manual de la puerta XOR-Op3 La puerta XOR-Op3 realiza la operación XOR entre los operandos a y b. Cuando el interruptor está activo, el operando b tiene un valor (`111` por defecto) de lo contrario el operando b es 0 El resultado de la operación XOR se muestra en los LRD RGB

source: ## Example: Manual testing of the XNOR gate
es_es: # Ejemplo: Comprobación manual de la puerta XNOR

source: ## Example: Manual testing of the XNOR-Op4 gate The XNOR-Op4 gate perform the XNOR operation between operand a and b. When the button is pressed the operand b has a value (`0011` by default) otherwise operand b is 0
es_es: # Ejemplo: Comprobación manual de la puerta XNOR-Op4 La puerta XNOR-Op4 realiza la operacion XNOR entre los operandos a y b. Cuando el botón se aprieta el operando b tiene el valor (`0011` por defecto) En cualquier otro caso el operando b es 0

source: ## Example: Manual testing of the XNOR-Op3 gate The XNOR-Op3 gate performs the XNOR operation between operands a and b. When the switch is ON the operand b has a value (`111` by default) otherwise operand b is 0 The result of the XNOR operation is shown on the RGB LED
es_es: # Ejemplo: Comprobación manual de la puerta XNOR-Op3 La puerta XNOR-Op3 realiza la operación XNOR entre los operandos a y b. Cuando el interruptor está activo, el operando b tiene un valor (`111` por defecto) de lo contrario el operando b es 0 El resultado de la operación XNOR se muestra en el LED RGB

source: ## Example: Manual testing of the NAND gate
es_es: # Ejemplo: Comprobación manual de la puerta NAND

source: ## Example: Manual testing of the NAND2 gate
es_es: # Ejemplo: Comprobación manual de la puerta NAND2

source: **NOR Gate**
es_es: **Puerta NOR**

source: ## Example: Manual testing of the NOR gate
es_es: # Ejemplo: Comprobación manual de la puerta NOR

source: # AND-Bus2 gate: Manual testing with two pushbutton and an LED The LED is only turned on when both buttons are pressed at the same time
es_es: # Puerta AND-Bus2: Comprobación manual con dos pulsadores y un LED El LED sólo se enciende cuando ambos botones están presionados a la vez

source: Constant bit 1
es_es: Bit constante 1

source: # AND-Bus3 gate: Manual testing with pushbuttons and an LED The LED is only turned on when both buttons are pressed at the same time
es_es: # Puerta AND-Bus3: Comprobación manual con pulsadores y un LED El LED sólo se enciende cuando ambos botones están presionados a la vez

source: # AND-Bus4 gate: Manual testing with pushbuttons and an LED The LED is only turned on when both buttons are pressed at the same time
es_es: # Puerta AND-Bus4: Comprobación manual con pulsadores y un LED El LED sólo se enciende cuando ambos botones están presionados a la vez

source: Bus5-Join-2-3: Join the two buses of 2 and 3 bits into a 5-bits Bus
es_es: Bus5-Join-2-3: Agrupar dos buses de 2 y 3 bits en un bus de 5 bits

source: # AND-Bus5 gate: Manual testing with pushbuttons and an LED The LED is only turned on when both buttons are pressed at the same time
es_es: # Puerta AND-Bus5: Comprobación manual con pulsadores y un LED El LED sólo se enciende cuando ambos botones están presionados a la vez

source: Bus6-Join-2-4: Join all the two buses into a 6-bits Bus
es_es: Bus6-Join-2-4: Agrupar los dos buses en uno de 6 bits

source: # AND-Bus6 gate: Manual testing with pushbuttons and an LED The LED is only turned on when both buttons are pressed at the same time
es_es: # Puerta AND-Bus6: Comprobación manual con pulsadores y un LED El LED sólo se enciende cuando ambos botones están presionados a la vez

source: Bus7-Join-2-5: Join the two buses into a 7-bits Bus
es_es: Bus6-Join-2-5: Agrupar los dos buses en uno de 7 bits

source: Generic: 5-bits generic constant (0-31)
es_es: Generic: Constantes genéricas de 5 bits (0-31)

source: # AND-Bus7 gate: Manual testing with pushbuttons and an LED The LED is only turned on when both buttons are pressed at the same time
es_es: # Puerta AND-Bus7: Comprobación manual con pulsadores y un LED El LED sólo se enciende cuando ambos botones están presionados a la vez

source: Bus8-Join-2-6: Join the two buses into an 8-bits Bus
es_es: Bus8-Join-2-6: Agrupar todos los cables en un bus de 8 bits

source: Generic: 6-bits generic constant (0-63)
es_es: Generic: Constantes genéricas de 6 bits (0-63)

source: # AND-Bus8 gate: Manual testing with pushbuttons and an LED The LED is only turned on when both buttons are pressed at the same time
es_es: # Puerta AND-Bus8: Comprobación manual con pulsadores y un LED El LED sólo se enciende cuando ambos botones están presionados a la vez

source: # AND-Busen2 gate: Manual testing with one pushbutton and two LEDs When the button is pressed, the two LEDs are turned on
es_es: # Puerta AND-Busend2: Comprobación manual con un pulsador y dos LED2 Cuando el botón se aprieta, los dos LEDs se encienden

source: 3bits constant value: 7
es_es: Valor constante 7 de 3 bits

source: # AND-Busen3 gate: Manual testing with one pushbutton and LEDs When the button is pressed, the LEDs are turned on
es_es: # Puerta AND-Busend3: Comprobación manual con un pulsador y LEDs Cuando el botón se aprieta, los LEDs se encienden

source: # AND-Busen4 gate: Manual testing with one pushbutton and LEDs When the button is pressed, the LEDs are turned on
es_es: # Puerta AND-Busend4: Comprobación manual con un pulsador y LEDs Cuando el botón se aprieta, los LEDs se encienden

source: # AND-Busen5 gate: Manual testing with one pushbutton and LEDs When the button is pressed, the LEDs are turned on
es_es: # Puerta AND-Busend5: Comprobación manual con un pulsador y LEDs Cuando el botón se aprieta, los LEDs se encienden

source: # AND-Busen6 gate: Manual testing with one pushbutton and LEDs When the button is pressed, the LEDs are turned on
es_es: # Puerta AND-Busend6: Comprobación manual con un pulsador y LEDs Cuando el botón se aprieta, los LEDs se encienden

source: Generic: 7-bits generic constant (0-127)
es_es: Generic: Constante genérica de 7 bits (0-127)

source: # AND-Busen7 gate: Manual testing with one pushbutton and LEDs When the button is pressed, the LEDs are turned on
es_es: # Puerta AND-Busend7: Comprobación manual con un pulsador y LEDs Cuando el botón se aprieta, los LEDs se encienden

source: Generic: 8-bits generic constant (0-255)
es_es: Generic: Constante genérica de 8 bits (0-255)

source: # AND-Busen8 gate: Manual testing with one pushbutton and LEDs When the button is pressed, the LEDs are turned on
es_es: # Puerta AND-Busend8: Comprobación manual con un pulsador y LEDs Cuando el botón se aprieta, los LEDs se encienden

source: Button-tic: Configurable button that emits a tic when it is pressed
es_es: Button-tic: Botón configurable que emite un tic cuando se pulsa

source: Rising-edge detector. It generates a 1-period pulse (tic) when a rising edge is detected on the input
es_es: Detector de flanco de subida. Se genera un pulso de 1 ciclo cuando se detecta un flanco de subida en la entrada

source: D Flip-flop (verilog implementation)
es_es: Biestable D (Implementación en verilog)

source: Configurable button (pull-up on/off. Not on/off)
es_es: Botón configurable (pull-up on/off. Not on/off)

source: FPGA internal pull-up configuration on the input port
es_es: Configuración del pull-up interno de la FPGA en puerto de entrada

source: Remove the rebound on a mechanical switch
es_es: Eliminar los rebotes de un interruptor mecánico

source: 1bit register (implemented in verilog)
es_es: Registro de 1 bit (Implementado en verilog)

source: 16-bits Syscounter with reset
es_es: Contador del sistema de 16 bits con reset

source: DFF-rst-x16: 16 D flip-flops in paralell with reset
es_es: DFF-rst-x16: 16 Biestables D en paralelo con reset

source: DFF-rst-x04: Three D flip-flops in paralell with reset
es_es: DFF-rst-x04: Tres Biestables D en paralelo con reset

source: DFF-rst-x01: D Flip flop with reset input. When rst=1, the DFF is 0
es_es: DFF-rst-x01: Biestable D con entrada de reset. Cuando rst=1, el Biestable se pone a 0

source: Bus16-Split-quarter: Split the 16-bits bus into four buses of the same size
es_es: Bus16-Split-half: Separar el bus de 16 bits en dos mitades del mismo tamaño

source: Bus16-Join-quarter: Join the four same buses into an 16-bits Bus
es_es: Bus16-Join-quarter: Agrupar los cuatro buses en uno de 16 bits

source: Inc1-16bit: Increment a 16-bits number by one
es_es: Inc1-16bit: Incrementar un número de 16 bits en uno

source: AdderK-16bit: Adder of 16-bit operand and 16-bit constant
es_es: AdderK-16bit: Sumador de un operando de 16 bits y una constante de 16 bits

source: Generic: 16-bits generic constant
es_es: Generic: Constante genéricas de 16 bits

source: Adder-16bits: Adder of two operands of 16 bits
es_es: Adder-16bits: Sumador de dos operandos de 16 bits

source: Adder-8bits: Adder of two operands of 8 bits
es_es: Adder-8bits: Sumador de dos operandos de 8 bits

source: Adder-4bits: Adder of two operands of 4 bits
es_es: Adder-4bits: Sumador de dos operandos de 4 bits

source: Adder-1bit: Adder of two operands of 1 bit
es_es: Adder-1bit: Sumador de dos operandos de 1 bit

source: AdderC-1bit: Adder of two operands of 1 bit plus the carry in
es_es: AdderC-1bit: Sumador de dos operandos de 1 bit más el acarreo de entrada

source: Constant bit 0
es_es: Bit constante 0

source: AdderC-4bits: Adder of two operands of 4 bits and Carry in
es_es: AdderC-4bits: Sumador de dos operandos de 4 bits más el acarreo de entrada

source: AdderC-8bits: Adder of two operands of 8 bits and Carry in
es_es: AdderC-8bit: Sumador de dos operandos de 8 bit más el acarreo de entrada

source: Edges detector. It generates a 1-period pulse (tic) when either a rising edge or a falling edge is detected on the input
es_es: Detector de flancos. Se genera un pulso de un ciclo cuando se detecta un flanco de subida o de bajada en la entrada

source: Sync 1-bit input with the system clock domain
es_es: Sincronizar una entrada de un bit con el dominio del reloj del sistema

source: Select positive or negative logic for the input (0=positive, 1=negative)
es_es: Seleccionar lógica positiva o negativa para la entrada (0=positiva, 1=negativa)

source: 1-bit generic constant (0/1)
es_es: Constante genérica de 1 bit (0/1)

source: 2-to-1 Multplexer (16-bit channels)
es_es: Multiplexor 2-1 (canales de 16 bits)

source: 2-to-1 Multplexer (8-bit channels)
es_es: Multiplexor 2-1 (Canales de 8 bits)

source: 2-to-1 Multplexer (4-bit channels)
es_es: Multiplexor 2-1 (Canales de 4 bits)

source: 2-to-1 Multplexer (1-bit channels)
es_es: Multiplexor 2-1 (Canales de 1 bit)

source: Display16-8: Display a 16-bits value on an 8-LEDs. The sel input selects the byte to display
es_es: Display16-8: Mostrar un valor de 16 bits en los 8 LEDs. La entrada sel selecciona el byte a mostrar

source: System TFF with toggle input: It toogles on every system cycle if the input is active
es_es: Biestable T del sistema con entrada de cambio: Cambia en cada ciclo del sistema si la entrada está activa

source: Reg: 1-Bit register
es_es: Reg: Registro de 1-Bit

source: 2-to-1 Multplexer (1-bit channels). Fippled version
es_es: Multiplexor 2-1 (Canales de 1 bit). Versión invertida

source: # AND-Op16: Manual testing with pushbuttons and LEDs The AND operation is applied to the 16-bits coming form the pushbuttons and a constant number. The result is shown on the LEDs
es_es: # AND-Op16: Comprobación manual con pulsadores y LEDs La operación AND se aplica entre los 16 bits que llegan de los pulsadores y y un número constante. El resultado se muestra en los LEDs

source: System clock
es_es: Reloj del sistema

source: Button state signal
es_es: Señal de estado del botón

source: Tic: button pressed
es_es: Tic: Botón apretado

source: Rising edge detector
es_es: Detector de flanco de subida

source: ## Rising edge detector It generates a 1-period pulse (tic) when a rising edge is detected on the input signal
es_es: ## Detector de flanco de subida Se genera un pulso de un ciclo cuando se detecta un flanco de subida en la señal de entrada

source: Input signal
es_es: Señal de entrada

source: Current signal state
es_es: Estado de la señal actual

source: Signal state in the previous clock cycle
es_es: Estado de la señal en el ciclo de reloj anterior

source: If the current signal is 1 and its value in the previous clock cycle was 0, it means that a rising edge has been detected! The output es 1 In any other case the output is 0
es_es: Si la señal actual es 1 y su valor en el ciclo previo era 0, significa que se ha detectado un flanco de subida! La salida es 1 En cualquier otro caso la salida es 0

source: **Delay**: 0 clock cycles There is no delay between the arrival of a rising edge and its detection
es_es: **Retraso**: 0 ciclos de reloj No hay retraso entre la llegada de un flanco de subida y su detección

source: Parameter: Initial value
es_es: Parámetro: Valor inicial

source: Input data
es_es: Datos de entrada

source: # D Flip-Flop It stores the input data that arrives at cycle n Its output is shown in the cycle n+1
es_es: # Biestable D El dato de entrada se almacena en el ciclo n Su salida se muestra en el ciclo n+1

source: Internal pull-up * 0: OFF * 1: ON
es_es: Pull-up interno * 0: OFF * 1: ON

source: Synchronization stage
es_es: Etapa de sincronización

source: Normalization stage * 0: Wire * 1: signal inverted
es_es: Etapa de normalización * 0: Cable * 1: Señal invertica

source: Debouncing stage
es_es: Etapa antirrebotes

source: ### Pull-up parameter: 0: No pull-up 1: Pull-up activated
es_es: ### Parámetro pull-up: 0: Sin pull-up 1: Pull-up activado

source: Only an FPGA pin can be connected here!!!
es_es: ¡¡Sólo se puede conectar aquí un pin de la FPGA!!

source: The pull-up is connected by default
es_es: El Pull-up se conecta por defecto

source: Edge detector
es_es: Detector de flancos

source: Whenever there is a change in the input, the counter is started
es_es: Siempre que haya un cambio en la entrada, se arranca el contador

source: If the counter reaches it maximum value, the input is considered stable and it is captured
es_es: Si el contador alcanza su máximo valor, la entrada se considera estable y se captura

source: ### Time calculation For CLK=12MHZ, a 16-bit counter reaches its maximum every 2 ** 16 * 1/F = 5.5ms aprox IF more time is needed for debouncing, use a counter with more bits (17, 18...)
es_es: ### Cálculo de tiempo Para CLK=12MHZ, un contador de 16 bits alcanza su valor máximo cada 2 ** 16 * 1/F = 5.5ms aprox Si se necesita más tiempo para el antirrebots, usa un contador con más bits (17, 18...)

source: ## Debouncer A value is considered stable when there is no changes during 5.5ms aprox. When a value is stable it is captured on the output flip-flop
es_es: ## Antirrebotes Un valor se considera estable cuando no hay cambios durante 5.5ms aprox Cuando un valor es estable se captura en el biestable

source: Stable output
es_es: Salida estable

source: Counter
es_es: Contador

source: Initial value
es_es: Valor inicial

source: Reset input: Active high When rst = 1, the DFF is reset to 0
es_es: Entrada de reset: Activa a nivel alto Cuando rst = 1, el biestable se inicializa a 0

source: Data input
es_es: Entrada de datos

source: Initial default value: 0
es_es: Valor inicial por defecto: 0

source: ## Edges detector It generates a 1-period pulse (tic) when an edge (Rising or falling) is detected on the input signal
es_es: ## Detector de flancos Se genera un pulso de un ciclo cuando un flanco (de subada o bajada) se detecta en la señal de entrada
