Repository: FPGAwars/iceGates
Catalog: locale/*/*.po
Languages: es_es

source: Two bits input And gate
es_es: Puerta AND de 2 entradas de un bit

source: AND3-verilog. 3- bits input And gate. Verilog implementation
es_es: AND3-verilog. Puerta AND de 3 entradas (Implementación en verilog)

source: AND4-verilog. 4-bits input And gate. Verilog implementation
es_es: AND4-verilog. Puerta AND de 4 entradas (Implementación en verilog)

source: AND5-verilog. 5-bits input And gate. Verilog implementation
es_es: AND5-verilog. Puerta AND de 5 entradas (Implementación en verilog)

source: AND6-verilog. 6-bits input And gate. Verilog implementation
es_es: AND5-verilog. Puerta AND de 6 entradas (Implementación en verilog)

source: AND7-verilog. 7-bits input And gate. Verilog implementation
es_es: AND7-verilog. Puerta AND de 7 entradas (Implementación en verilog)

source: AND8-verilog. 8-bits input And gate. Verilog implementation
es_es: AND8-verilog. Puerta AND de 8 entradas (Implementación en verilog)

source: AND-BUS2-verilog. And gate with 2-bits bus input. Verilog implementation
es_es: AND-BUS2-verilog. Puerta AND con entrada de bus de 2 bits. Implementación en verilog

source: AND-BUS3-verilog. And gate with 3-bits bus input. Verilog implementation
es_es: AND-BUS3-verilog. Puerta AND con entrada de bus de 3 bits. Implementación en verilog

source: AND-BUS4-verilog. And gate with 4-bits bus input. Verilog implementation
es_es: AND-BUS4-verilog. Puerta AND con entrada de bus de 4 bits. Implementación en verilog

source: AND-BUS5-verilog. And gate with 5-bits bus input. Verilog implementation
es_es: AND-BUS5-verilog. Puerta AND con entrada de bus de 5 bits. Implementación en verilog

source: AND-BUS6-verilog. And gate with 6-bits bus input. Verilog implementation
es_es: AND-BUS6-verilog. Puerta AND con entrada de bus de 6 bits. Implementación en verilog

source: AND-BUS7-verilog. And gate with 7-bits bus input. Verilog implementation
es_es: AND-BUS7-verilog. Puerta AND con entrada de bus de 7 bits. Implementación en verilog

source: AND-BUS8-verilog. And gate with 8-bits bus input. Verilog implementation
es_es: AND-BUS8-verilog. Puerta AND con entrada de bus de 8 bits. Implementación en verilog

source: AND-BUS2. And gate with 2-bits bus input
es_es: AND-BUS2. Puerta AND con entrada de bus de 2 bits

source: Bus2-Split-all: Split the 2-bits bus into two wires
es_es: Bus2-Split-all: Separar el bus de 2 bits en sus cables

source: AND-BUS3. And gate with 3-bits bus input
es_es: AND-BUS3. Puerta AND con entrada de bus de 3 bits

source: Bus3-Split-all: Split the 3-bits bus into three wires
es_es: Bus3-Split-all: Separar el bus de 3 bits en sus cables

source: AND-BUS4. And gate with 4-bits bus input
es_es: AND-BUS4. Puerta AND con entrada de bus de 4 bits

source: Bus4-Split-all: Split the 4-bits bus into its wires
es_es: Bus4-Split-all: Separar el bus de 4 bits en sus cables

source: AND-BUS5. And gate with 5-bits bus input
es_es: AND-BUS5. Puerta AND con entrada de bus de 5 bits

source: Bus5-Split-3-2: Split the 5-bits bus into two buses of 3 and 2 bits
es_es: Bus5-Split-3-2: Separar el bus de 5 bits en dos buses de 3 y 2 bits

source: AND-BUS6. And gate with 6-bits bus input
es_es: AND-BUS6. Puerta AND con entrada de bus de 6 bits

source: Bus6-Split-2-4: Split the 6-bits bus into two buses of 2 and 4 wires
es_es: Bus6-Split-2-4: Separar el bus de 6 bits en dos buses de 2 y 4 cables

source: AND-BUS7. And gate with 7-bits bus input
es_es: AND-BUS7. Puerta AND con entrada de bus de 7 bits

source: Bus7-Split-3-4: Split the 7-bits bus into two buses of 3 and 4 wires
es_es: Bus7-Split-3-4: Separar el bus de 7 bits en dos buses de 3 y 4 cables

source: AND-BUS8. And gate with 8-bits bus input
es_es: AND-BUS8. Puerta AND con entrada de bus de 8 bits

source: Bus8-Split-half: Split the 8-bits bus into two buses of the same size
es_es: Bus8-Split-half: Separar el bus de 8 bits en dos mitades del mismo tamaño

source: AND-Busen-2-verilog: Enable a 2-bits bus. When the enable signal is 0, the output is 0. Verilog implementation
es_es: AND-Busen-2-verilog: Habilitar un bus de dos bits. Cuando la señal de enable es 0, la salida es 0. Implementación en verilog

source: Enable input
es_es: Habilitar la entrada

source: Bus input
es_es: Bus de entrada

source: Bus output
es_es: Bus de salida

source: AND-Busen-3-verilog: Enable a 3-bits bus. When the enable signal is 0, the output is 0. Verilog implementation
es_es: AND-Busen-3-verilog: Habilitar un bus de 3 bits. Cuando la señal de enable es 0, la salida es 0. Implementación en verilog

source: AND-Busen-4-verilog: Enable a 4-bits bus. When the enable signal is 0, the output is 0. Verilog implementation
es_es: AND-Busen-4-verilog: Habilitar un bus de 4 bits. Cuando la señal de enable es 0, la salida es 0. Implementación en verilog

source: AND-Busen-5-verilog: Enable a 5-bits bus. When the enable signal is 0, the output is 0. Verilog implementation
es_es: AND-Busen-5-verilog: Habilitar un bus de 5 bits. Cuando la señal de enable es 0, la salida es 0. Implementación en verilog

source: AND-Busen-6-verilog: Enable a 6-bits bus. When the enable signal is 0, the output is 0. Verilog implementation
es_es: AND-Busen-6-verilog: Habilitar un bus de 6 bits. Cuando la señal de enable es 0, la salida es 0. Implementación en verilog

source: AND-Busen-7-verilog: Enable a 7-bits bus. When the enable signal is 0, the output is 0. Verilog implementation
es_es: AND-Busen-7-verilog: Habilitar un bus de 7 bits. Cuando la señal de enable es 0, la salida es 0. Implementación en verilog

source: AND-Busen-8: Enable a 8-bits bus. When the enable signal is 0, the output is 0
es_es: AND-Busen-2: Habilitar un bus de 8 bits. Cuando la señal de enable es 0, la salida es 0

source: Bus8-Join-half: Join the two same halves into an 8-bits Bus
es_es: Bus8-Join-half: Agrupar los dos buses iguales en uno de 8 bits

source: AND-Busen-2: Enable a 2-bits bus. When the enable signal is 0, the output is 0
es_es: AND-Busen-2: Habilitar un bus de dos bits. Cuando la señal de enable es 0, la salida es 0

source: Bus2-Join-all: Joint two wires into a 2-bits Bus
es_es: Bus2-Join-all: Agrupar dos cables en un bus de 2 bits

source: AND-Busen-3: Enable a 3-bits bus. When the enable signal is 0, the output is 0
es_es: AND-Busen-3: Habilitar un bus de 3 bits. Cuando la señal de enable es 0, la salida es 0

source: Bus3-Join-all: Joint three wires into a 3-bits Bus
es_es: Bus3-Join-all: Agrupar tres cables en un bus de 3 bits

source: AND-Busen-4: Enable a 4-bits bus. When the enable signal is 0, the output is 0
es_es: AND-Busen-4: Habilitar un bus de 4 bits. Cuando la señal de enable es 0, la salida es 0

source: Bus4-Join-all: Join all the wires into a 4-bits Bus
es_es: Bus4-Join-all: Agrupar todos los cables en un bus de 4 bits

source: AND-Busen-5: Enable a 5-bits bus. When the enable signal is 0, the output is 0
es_es: AND-Busen-5: Habilitar un bus de 5-bits. Cuando la señal de enable es 0, la salida es 0

source: Bus5-Split-all: Split the 5-bits bus into its wires
es_es: Bus5-Split-all: Separar el bus de 5 bits en sus cables

source: Bus5-Join-all: Join all the wires into a 5-bits Bus
es_es: Bus5-Join-all: Agrupar todos los cables en un bus de 5 bits

source: AND-Busen-6: Enable a 6-bits bus. When the enable signal is 0, the output is 0
es_es: AND-Busen-6: Habilitar un bus de 6 bits. Cuando la señal de enable es 0, la salida es 0

source: Bus6-Split-half: Split the 6-bits bus into two buses of 3 wires
es_es: Bus6-Join-half: Agrupar los dos buses en uno de 6 bits

source: Bus6-Join-half: Join the two buses into a 6-bits Bus
es_es: Bus6-Join-half: Agrupar los dos buses en uno de 6 bits

source: AND-Busen-7: Enable a 7-bits bus. When the enable signal is 0, the output is 0
es_es: AND-Busen-7: Habilitar un bus de 7 bits. Cuando la señal de enable es 0, la salida es 0

source: Bus7-Split-4-3: Split the 7-bits bus into two buses of 4 and 3 wires
es_es: Bus7-Split-4-3: Separar el bus de 7 bits en dos buses de 4 y 3 cables

source: Bus7-Join-4-3: Join the two buses into a 7-bits Bus
es_es: Bus6-Join-4-3: Agrupar los dos buses en uno de 7 bits

source: AND-Op16-verilog: And operation between two numbers of 16 bits. Verilog implementation
es_es: AND-Op16-verilog: Operación AND entre dos números de 16 bits. Implementación en Verilog

source: Operand 1
es_es: Operando 1

source: Operand 2
es_es: Operando 2

source: AND-Op2-verilog: And operation between two numbers of 2 bits. Verilog implementation
es_es: AND-Op2-verilog: Operación AND entre dos números de 2 bits. Implementación en Verilog

source: AND-Op3-verilog: And operation between two numbers of 3 bits. Verilog implementation
es_es: AND-Op3-verilog: Operación AND entre dos números de 3 bits. Implementación en Verilog

source: AND-Op4-verilog: And operation between two numbers of 4 bits. Verilog implementation
es_es: AND-Op4-verilog: Operación AND entre dos números de 4 bits. Implementación en Verilog

source: AND-Op5-verilog: And operation between two numbers of 5 bits. Verilog implementation
es_es: AND-Op5-verilog: Operación AND entre dos números de 5 bits. Implementación en Verilog

source: AND-Op6-verilog: And operation between two numbers of 6 bits. Verilog implementation
es_es: AND-Op6-verilog: Operación AND entre dos números de 6 bits. Implementación en Verilog

source: AND-Op7-verilog: And operation between two numbers of 7 bits. Verilog implementation
es_es: AND-Op7-verilog: Operación AND entre dos números de 7 bits. Implementación en Verilog

source: AND-Op8-verilog: And operation between two numbers of 8 bits. Verilog implementation
es_es: AND-Op8-verilog: Operación AND entre dos números de 8 bits. Implementación en Verilog

source: AND-Op16: And operation between two numbers of 16 bits
es_es: AND-Op16: Operación AND entre dos números de 16 bits

source: Bus16-Join-half: Join the two same halves into an 16-bits Bus
es_es: Bus16-Join-half: Agrupar los dos buses iguales en uno de 16 bits

source: Bus16-Split-half: Split the 16-bits bus into two buses of the same size
es_es: Bus16-Split-half: Separar el bus de 16 bits en dos mitades del mismo tamaño

source: AND-Op2: And operation between two numbers of 2 bits
es_es: AND-Op2: Operación AND entre dos números de 2 bits

source: AND-Op3: And operation between two numbers of 3 bits
es_es: AND-Op3: Operación AND entre dos números de 3 bits

source: Bus3-Split-2-1: Split the 3-bits bus into two: 2-bit and 1-bits buses
es_es: Bus5-Split-2-1: Separar el bus de 3 bits en dos buses de 2 y 1 bits

source: Bus3-Join-2-1: Joint two buses of 1 and 2 bits into a 3-bits Bus
es_es: Bus3-Join-2-1: Agrupar dos buses de 1 y 2 bits en un bus de 3 bits

source: AND-Op4: And operation between two numbers of 4 bits
es_es: AND-Op4: Operación AND entre dos números de 4 bits

source: Bus4-Split-half: Split the 4-bits bus into two of the same size
es_es: Bus4-Split-half: Separar el bus de 4 bits en dos mitades del mismo tamaño

source: Bus4-Join-half: Join the two buses into a 4-bits Bus
es_es: Bus4-Join-all: Agrupar todos los cables en un bus de 4 bits

source: AND-Op5: And operation between two numbers of 5 bits
es_es: AND-Op5: Operación AND entre dos números de 5 bits

source: Bus5-Join-3-2: Join the two buses of 3 and 2 bits into a 5-bits Bus
es_es: Bus5-Join-3-2: Agrupar dos buses de 3 y 2 bits en un bus de 5 bits

source: AND-Op6: And operation between two numbers of 6 bits
es_es: AND-Op6: Operación AND entre dos números de 6 bits

source: AND-Op7: And operation between two numbers of 7 bits
es_es: AND-Op7: Operación AND entre dos números de 7 bits

source: AND-Op8: And operation between two numbers of 8 bits
es_es: AND-Op8: Operación AND entre dos números de 8 bits

source: Three bits input And gate
es_es: Puerta AND de 3 entradas de un bit

source: And5: five bits input And gate
es_es: AND5: Puerta AND de 5 entradas de un bit

source: And6: six bits input And gate
es_es: AND6: Puerta AND de 6 entradas de un bit

source: And7: seven bits input And gate
es_es: AND7: Puerta AND de 7 entradas de un bit

source: And8: 8-bits input And gate
es_es: AND8: Puerta AND de 8 entradas de un bit

source: Nand-x02: two input NAND gate. Verilog implementation
es_es: Nand-x02: Puerta NAND de dos entradas de un bit. Implementación en Verilog

source: Nand-x02: two input NAND gate
es_es: Nand-x02: Puerta NAND de dos entradas de un bit

source: NOT gate (Verilog implementation)
es_es: Puerta Not (Implementación en verilog)

source: Input
es_es: Entrada

source: Output
es_es: Salida

source: Nor-x02-verilog: 2 input NOR gate. Verilog implementation
es_es: Nor-x02-verilog: Puerta Nor de 2 entradas. Implementación en Verilog

source: Nor-x02: two input NOR gate
es_es: Nor-x02: Puerta NOR de dos entradas de un bit

source: OR2: Two bits input OR gate
es_es: OR2: Puerta OR de entradas de un bit

source: not-x2-verilog: 2-bits not gate. Verilog implementation
es_es: not-x2-verilog: Puerta Not de 2 bits. Implementación en Verilog

source: not-x3-verilog: 3-bits not gate. Verilog implementation
es_es: not-x3-verilog: Puerta Not de 3 bits. Implementación en Verilog

source: not-x4-verilog: 4-bits not gate. Verilog implementation
es_es: not-x4-verilog: Puerta Not de 4 bits. Implementación en Verilog

source: not-x5-verilog: 5-bits not gate. Verilog implementation
es_es: not-x5-verilog: Puerta Not de 5 bits. Implementación en Verilog

source: not-x6-verilog: 6-bits not gate. Verilog implementation
es_es: not-x6-verilog: Puerta Not de 6 bits. Implementación en Verilog

source: not-x7-verilog: 7-bits not gate. Verilog implementation
es_es: not-x7-verilog: Puerta Not de 7 bits. Implementación en Verilog

source: not-x8-verilog: 8-bits not gate. Verilog implementation
es_es: not-x8-verilog: Puerta Not de 8 bits. Implementación en Verilog

source: not-x16-verilog: 16-bits not gate. Verilog implementation
es_es: not-x16-verilog: Puerta Not de 16 bits. Implementación en Verilog

source: not-x32: 32-bits not gate
es_es: not-x32: Puerta not de entrada de 32 bits

source: not-x2: 2-bits not gate
es_es: not-x2: Puerta not de entrada de 2 bits

source: not-x3: 3-bits not gate
es_es: not-x3: Puerta not de entrada de 3 bits

source: not-x4: 4-bits not gate
es_es: not-x4: Puerta not de entrada de 4 bits

source: not-x5: 5-bits not gate
es_es: not-x5: Puerta not de entrada de 5 bits

source: Bus5-Join-4-1: Join the two buses of 4 and 1 bits into a 5-bits Bus
es_es: Bus5-Join-4-1: Agrupar dos buses de 4 y 1 bits en un bus de 5 bits

source: Bus5-Split-4-1: Split the 5-bits bus into two buses of 4 and 1 bits
es_es: Bus5-Split-4-1: Separar el bus de 5 bits en dos buses de 4 y 1 bits

source: not-x6: 6-bits not gate
es_es: not-x6: Puerta not de entrada de 6 bits

source: Bus6-Join-4-2: Join the two buses into a 6-bits Bus
es_es: Bus6-Join-4-2: Agrupar los dos buses en uno de 6 bits

source: Bus6-Split-4-2: Split the 6-bits bus into two buses of 4 and 2 wires
es_es: Bus6-Split-4-2: Separar el bus de 6 bits en dos buses de 4 y 2 cables

source: not-x7: 7-bits not gate
es_es: not-x7: Puerta not de entrada de 7 bits

source: not-x8: 8-bits not gate
es_es: not-x8: Puerta not de entrada de 8 bits

source: not-x16: 16-bits not gate
es_es: not-x16: Puerta not de 6 bits

source: OR3-verilog: 3-bits input OR gate. Verilog implementation
es_es: OR3-verilog: Puerta OR de 3bits. Implementación en Verilog

source: OR4-verilog: 4-bits input OR gate. Verilog implementation
es_es: OR4-verilog: Puerta OR de 4bits. Implementación en Verilog

source: OR5-verilog: 5-bits input OR gate. Verilog implementation
es_es: OR5-verilog: Puerta OR de 5bits. Implementación en Verilog

source: OR6-verilog: 6-bits input OR gate. Verilog implementation
es_es: OR6-verilog: Puerta OR de 6bits. Implementación en Verilog

source: OR7-verilog: 7-bits input OR gate. Verilog implementation
es_es: OR7-verilog: Puerta OR de 7bits. Implementación en Verilog

source: OR8-verilog: 8-bits input OR gate. Verilog implementation
es_es: OR8-verilog: Puerta OR de 8bits. Implementación en Verilog

source: OR3: Three bits input OR gate
es_es: OR3: Puerta OR de 3 entradas de un bit

source: OR4: Four bits input OR gate
es_es: OR4: Puerta OR de entradas de un bit

source: OR5: 5 bits input OR gate
es_es: OR5: Puerta OR de 5 entradas de un bit

source: OR6: 6 bits input OR gate
es_es: OR6: Puerta OR de 6 entradas de un bit

source: Or7: Seven bits input OR gate
es_es: OR7: Puerta OR de 7 entradas de un bit

source: OR8: Eight bits input OR gate
es_es: OR8: Puerta OR de 8 entradas de un bit

source: OR-BUS2-verilog: OR gate with 2-bits bus input. Verilog implementation
es_es: OR-BUS2-verilog: Puerta OR de 2bits. Implementación en Verilog

source: OR-BUS3-verilog: OR gate with 3-bits bus input. Verilog implementation
es_es: OR-BUS3-verilog: Puerta OR de 3bits. Implementación en Verilog

source: OR-BUS4-verilog: OR gate with 4-bits bus input. Verilog implementation
es_es: OR-BUS4-verilog: Puerta OR de 4bits. Implementación en Verilog

source: OR-BUS5-verilog: OR gate with 5-bits bus input. Verilog implementation
es_es: OR-BUS5-verilog: Puerta OR de 5bits. Implementación en Verilog

source: OR-BUS6-verilog: OR gate with 6-bits bus input. Verilog implementation
es_es: OR-BUS6-verilog: Puerta OR de 6-bits. Implementación en Verilog

source: OR-BUS7-verilog: OR gate with 7-bits bus input. Verilog implementation
es_es: OR-BUS7-verilog: Puerta OR de 7-bits. Implementación en Verilog

source: OR-BUS8-verilog: OR gate with 8-bits bus input. Verilog implementation
es_es: OR-BUS8-verilog: Puerta OR de 8bits. Implementación en Verilog

source: OR-BUS2: OR gate with 2-bits bus input
es_es: OR-BUS2. Puerta OR con entrada de bus de 2 bits

source: OR-BUS3: OR gate with 3-bits bus input
es_es: OR-BUS3. Puerta OR con entrada de bus de 3 bits

source: OR-BUS4: OR gate with 4-bits bus input
es_es: OR-BUS4. Puerta OR con entrada de bus de 4 bits

source: OR-BUS5: OR gate with 5-bits bus input
es_es: OR-BUS5. Puerta OR con entrada de bus de 5 bits

source: OR-BUS6: OR gate with 6-bits bus input
es_es: OR-BUS6. Puerta OR con entrada de bus de 6 bits

source: OR-BUS7: OR gate with 7-bits bus input
es_es: OR-BUS7. Puerta OR con entrada de bus de 7 bits

source: Bus7-Split-all: Split the 7-bits bus into its wires
es_es: Bus7-Split-all: Separar el bus de 7 bits en sus cables

source: OR-BUS8: OR gate with 8-bits bus input
es_es: OR-BUS8. Puerta OR con entrada de bus de 8 bits

source: Bus8-Split-all: Split the 8-bits bus into its wires
es_es: Bus8-Split-all: Separar el bus de 8 bits en sus cables

source: OR-Op16-verilog: Or operation between two numbers of 16 bits. Verilog implementation
es_es: OR-Op16-verilog: Operación OR entre dos números de 16 bits. Implementación en Verilog

source: OR-Op2-verilog: Or operation between two numbers of 2 bits. Verilog implementation
es_es: OR-Op2-verilog: Operación OR entre dos números de 2 bits. Implementación en Verilog

source: OR-Op3-verilog: Or operation between two numbers of 3 bits. Verilog implementation
es_es: OR-Op3-verilog: Operación OR entre dos números de 3 bits. Implementación en Verilog

source: OR-Op4-verilog: Or operation between two numbers of 4 bits. Verilog implementation
es_es: OR-Op4-verilog: Operación OR entre dos números de 4 bits. Implementación en Verilog

source: OR-Op5-verilog: Or operation between two numbers of 5 bits. Verilog implementation
es_es: OR-Op5-verilog: Operación OR entre dos números de 5 bits. Implementación en Verilog

source: OR-Op6-verilog: Or operation between two numbers of 6 bits. Verilog implementation
es_es: OR-Op6-verilog: Operación OR entre dos números de 6 bits. Implementación en Verilog

source: OR-Op7-verilog: Or operation between two numbers of 7 bits. Verilog implementation
es_es: OR-Op7-verilog: Operación OR entre dos números de 7 bits. Implementación en Verilog

source: OR-Op8-verilog: Or operation between two numbers of 8 bits. Verilog implementation
es_es: OR-Op8-verilog: Operación OR entre dos números de 8 bits. Implementación en Verilog

source: OR-Op16: Or operation between two numbers of 16 bits
es_es: OR-Op16: Operación OR entre dos números de 16 bits

source: OR-Op2: Or operation between two numbers of 2 bits
es_es: OR-Op2: Operación OR entre dos números de 2 bits

source: OR-Op3: Or operation between two numbers of 3 bits
es_es: OR-Op2: Operación OR entre dos números de 3 bits

source: Or-Op4: Or operation between two numbers of 4 bits
es_es: OR-Op4: Operación OR entre dos números de 4 bits

source: OR-Op5: And operation between two numbers of 5 bits
es_es: OR-Op5: Operación OR entre dos números de 5 bits

source: OR-Op6: Or operation between two numbers of 6 bits
es_es: OR-Op6: Operación OR entre dos números de 6 bits

source: OR-Op7: OR operation between two numbers of 7 bits
es_es: OR-Op7: Operación OR entre dos números de 7 bits

source: OR-Op8: Or operation between two numbers of 8 bits
es_es: OR-Op8: Operación OR entre dos números de 8 bits

source: XNor-x02-verilog: 2-bits input XNOR gate. Verilog implementation
es_es: XNor-x02-verilog: Puerta XNOR de 2 bits. Implementación en Verilog

source: XNor-x02: two input XNOR gate
es_es: Xnor-x02: Puerta XNOR de 2 entradas de un bit

source: XOR gate: 2-bits input xor gate. Verilog implementation
es_es: XOR-gate: Puerta XOR de 2-bits. Implementación en verilog

source: XNOR gate-verilog: 2 bits input xnor gate. Verilog implementation
es_es: XNOR gate-verilog: Puerta XNOR de 2-bits. Implementación en Verilog

source: XNOR gate-verilog: 3 bits input xnor gate. Verilog implementation
es_es: XNOR gate-verilog: Puerta XNOR de 4-bits. Implementación en Verilog

source: XNOR gate-verilog: 4 bits input xnor gate. Verilog implementation
es_es: XNOR gate-verilog: Puerta XNOR de 4-bits. Implementación en Verilog

source: XNOR gate: two bits input xnor gate
es_es: Puerta XNOR de 2 entradas de un bit

source: XNOR-Op3: Xnor operation between two numbers of 3 bits
es_es: Xnor-op3

source: XNOR-Op4: Xnor operation between two numbers of 4 bits
es_es: XNOR-Op4: operación XNOR entre dos números de 4 bits

source: XOR gate: two bits input xor gate
es_es: Puerta XOR de 2 entradas de un bit

source: XOR gate: 3-bits input xor gate. Verilog implementation
es_es: XOR-gate: Puerta XOR de 3-bits. Implementación en verilog

source: XOR gate: 4-bits input xor gate. Verilog implementation
es_es: XOR-gate: Puerta XOR de 4-bits. Implementación en verilog

source: XOR-Op3: Xor operation between two numbers of 3 bits
es_es: XOR-Op3: operación XOR entre dos números de 3 bits

source: XOR-Op4: Xor operation between two numbers of 4 bits
es_es: XOR-Op4: operación XOR entre dos números de 4 bits

source: TESTs
es_es: Pruebas

source: 00-Index
es_es: 00-Indice

source: AND-Busen-8-verilog: Enable a 8-bits bus. When the enable signal is 0, the output is 0. Verilog implementation
es_es: AND-Busen-8-verilog: Habilitar un bus de 8 bits. Cuando la señal de enable es 0, la salida es 0. Implementación en Verilog

source: # INDEX: IceGate Collection
es_es: # ÍNDICE: Colección IceGate

source: 001-Index
es_es: 001-Indice

source: ## INPUTS
es_es: ## ENTRADAS

source: **AND Gate**
es_es: ** Puerta AND**

source: ## Example: Manual testing of the AND2 gate The LED is only ON when the two buttons SW1 and SW2 are pressed
es_es: # Ejemplo: Comprobación manual de la puerta AND2 El LED sólo se enciende cuando los dos botones SW1 y SW2 se pulsan

source: ## OUTPUT
es_es: ## SALIDA

source: 2bits constant value: 3
es_es: Valor constante 3 de 2 bits

source: Generic: 2-bits generic constant (0,1,2,3)
es_es: Generic: Constantes genéricas de 2 bits (0,1,2,3)

source: ## Example: Manual testing of the AND2 gate The RGB LED is turned GREEN only when the two buttons SW1 and SW2 are ON
es_es: # Ejemplo: Comprobación manual de la puerta AND2 El LED RBG se pone VERDE sólo cuando los dos botones SW1 y SW2 están activados

source: ## RGB LED
es_es: ## LED RGB
